StephenGit597/STM32F103C8_Header_Files/STM32F103C8_TIMx.h
/*-----------------------------------*/
/*          Designer:Stephen         */
/*           SWU_AI_2024_1           */
/*-----------------------------------*/
#ifndef STM32F103C8_TIMx_h
#define STM32F103C8_TIMx_h
//必要头文件引用
#include <stdint.h>//C99位宽头文件

/*定时器*/
//定时器基地址常量定义
#define TIM1_BASE 0x40012C00
#define TIM2_BASE 0x40000000
#define TIM3_BASE 0x40000400
#define TIM4_BASE 0x40000800
//定时器基地址定义
#define TIM1 ((Typedef_Advance_Timer*)TIM1_BASE)
#define TIM2 ((Typedef_General_Timer*)TIM2_BASE)
#define TIM3 ((Typedef_General_Timer*)TIM3_BASE)
#define TIM4 ((Typedef_General_Timer*)TIM4_BASE)
/*高级定时器*/
typedef struct
{
	volatile uint32_t CR1;   //偏移量0x00 Control Register 1
	volatile uint32_t CR2;   //偏移量0x04 Control Register 2
	volatile uint32_t SMCR;  //偏移量0x08 Slave Mode Control Register
	volatile uint32_t DIER;  //偏移量0x0C DMA/Interrupt Enable Register
	volatile uint32_t SR;    //偏移量0x10 Status Register
	volatile uint32_t EGR;   //偏移量0x14 Event Generation Registere
	volatile uint32_t CCMR1; //偏移量0x18 Capture/Compare Mode Register 1
	volatile uint32_t CCMR2; //偏移量0x1C Capture/Compare Mode Register 2
	volatile uint32_t CCER;  //偏移量0x20 Capture/Compare Enable Register
	volatile uint32_t CNT;   //偏移量0x24 Counter Register
	volatile uint32_t PSC;   //偏移量0x28 Prescaler Register
	volatile uint32_t ARR;   //偏移量0x2C Auto-Reload Register
	volatile uint32_t RCR;   //偏移量0x30 Repetition Counter Register
	volatile uint32_t CCR1;  //偏移量0x34 Capture/Compare Register 1
	volatile uint32_t CCR2;  //偏移量0x38 Capture/Compare Register 2
	volatile uint32_t CCR3;  //偏移量0x3C Capture/Compare Register 3
	volatile uint32_t CCR4;  //偏移量0x40 Capture/Compare Register 4
	volatile uint32_t BDTR;  //偏移量0x44 Break and Dead-Time Register
	volatile uint32_t DCR;   //偏移量0x48 DMA Control Register
	volatile uint32_t DMAR;  //偏移量0x4C DMA Address for Register Access
}Typedef_Advance_Timer;
/*通用寄存器*/
typedef struct
{
	volatile uint32_t CR1;   //偏移量0x00 Control Register 1
	volatile uint32_t CR2;   //偏移量0x04 Control Register 2
	volatile uint32_t SMCR;  //偏移量0x08 Slave Mode Control Register
	volatile uint32_t DIER;  //偏移量0x0C DMA/Interrupt Enable Register
	volatile uint32_t SR;    //偏移量0x10 Status Register
	volatile uint32_t EGR;   //偏移量0x14 Event Generation Registere
	volatile uint32_t CCMR1; //偏移量0x18 Capture/Compare Mode Register 1
	volatile uint32_t CCMR2; //偏移量0x1C Capture/Compare Mode Register 2
	volatile uint32_t CCER;  //偏移量0x20 Capture/Compare Enable Register
	volatile uint32_t CNT;   //偏移量0x24 Counter Register
	volatile uint32_t PSC;   //偏移量0x28 Prescaler Register
	volatile uint32_t ARR;   //偏移量0x2C Auto-Reload Register
	volatile uint32_t None1;   //偏移量0x30 占位符
	volatile uint32_t CCR1;  //偏移量0x34 Capture/Compare Register 1
	volatile uint32_t CCR2;  //偏移量0x38 Capture/Compare Register 2
	volatile uint32_t CCR3;  //偏移量0x3C Capture/Compare Register 3
	volatile uint32_t CCR4;  //偏移量0x40 Capture/Compare Register 4
	volatile uint32_t None2;  //偏移量0x44 占位符
	volatile uint32_t DCR;   //偏移量0x48 DMA Control Register
	volatile uint32_t DMAR;  //偏移量0x4C DMA Address for Register Access
}Typedef_General_Timer;

//Control Register 1
#define TIMx_CR1_Config_CEN 0x00000001
//禁止更新时间
#define TIMx_CR1_Config_Update_Disable 0x00000002
//触发模式
#define TIMx_CR1_Config_Update_trigger_software 0x00000004
//计数溢出后是否重装载
#define TIMx_CR1_Config_Update_operation 0x00000000
#define TIMx_CR1_Config_Update_operation_Dsiable 0x00000008
//计数方向
#define TIMx_CR1_Config_Count_Up 0x00000000
#define TIMx_CR1_Config_Count_Down 0x000000010
//计数器更新模式
#define TIMx_CR1_Config_Disable_Center_aligned 0x00000000
#define TIMx_CR1_Config_Update_when_count_up 0x00000020
#define TIMx_CR1_Config_Update_when_count_Down 0x00000040
#define TIMx_CR1_Config_Update_when_count_Up_Down 0x00000060
//ARR PRE
#define TIMx_CR1_Config_ARR_Pre_Enable 0x00000080
//CKD时钟分频
#define TIMx_CR1_Config_CKD_None 0x00000000
#define TIMx_CR1_Config_CKD_2 0x000000100
#define TIMx_CR1_Config_CKD_4 0x000000200

//Control Register 2
#define TIMx_advance_CR2_Config_Capture_compare_Preload_Enable 0x00000001
#define TIMx_advance_CR2_Config_Capture_compare_Update_Preload_Enable 0x00000004
#define TIMx_advance_CR2_Config_Capture_compare_Trigger_DMA_Dnable 0x00000008
//主机模式选择
#define TIMx_CR2_Config_Master_Mode_Reset 0x00000000
#define TIMx_CR2_Config_Master_Mode_Enable 0x00000010
#define TIMx_CR2_Config_Master_Mode_Update 0x00000020
#define TIMx_CR2_Config_Master_Mode_Compare_Pulse 0x00000030
#define TIMx_advance_CR2_Config_Master_Mode_CR2_Config_Master_Mode_OC1REF 0x00000040
#define TIMx_advance_CR2_Config_Master_Mode_CR2_Config_Master_Mode_OC2REF 0x00000050
#define TIMx_advance_CR2_Config_Master_Mode_CR2_Config_Master_Mode_OC3REF 0x00000060
#define TIMx_advance_CR2_Config_Master_Mode_CR2_Config_Master_Mode_OC4REF 0x00000070
//TL选择
#define TIMx_CR2_Config_Tl1_combation_XOR_Enable 0x00000080
//通道对应GPIO引脚空闲电平
#define TIMx_advance_CR2_Config_OIS1_CH1_high 0x00000100
#define TIMx_advance_CR2_Config_OIS1N_CH1N_high 0x00000200
#define TIMx_advance_CR2_Config_OIS2_CH2_high 0x00000400
#define TIMx_advance_CR2_Config_OIS2N_CH2N_high 0x00000800
#define TIMx_advance_CR2_Config_OIS3_CH3_high 0x00001000
#define TIMx_advance_CR2_Config_OIS3N_CH3N_high 0x00002000
#define TIMx_advance_CR2_Config_OIS4_CH4_high 0x00004000

//Slave Mode Control Register
//从模式
#define TIMx_SMCR_Config_Slave_mode_Disable 0x00000000
#define TIMx_SMCR_Config_Slave_mode_TI2_Count 0x00000001
#define TIMx_SMCR_Config_Slave_mode_TI1_Count 0x00000002
#define TIMx_SMCR_Config_Slave_mode_TI1_TI2_Count 0x00000003
#define TIMx_SMCR_Config_Slave_mode_Reset 0x00000004
#define TIMx_SMCR_Config_Slave_mode_Gate 0x00000005
#define TIMx_SMCR_Config_Slave_mode_Trigger 0x00000006
#define TIMx_SMCR_Config_Slave_mode_extern_clk 0x00000007
//Trigger Input
#define TIMx_SMCR_Config_Trigger_TIM2_TRGO 0x00000000
#define TIMx_SMCR_Config_Trigger_TIM1_TRGO 0x00000010
#define TIMx_SMCR_Config_Trigger_TIM3_TRGO 0x00000020
#define TIMx_SMCR_Config_Trigger_TIM4_TRGO 0x00000030
#define TIMx_SMCR_Config_Trigger_TI1_edge_dection 0x00000040
#define TIMx_SMCR_Config_Trigger_filterd_TI1 0x00000050
#define TIMx_SMCR_Config_Trigger_filterd_TI2 0x00000060
#define TIMx_SMCR_Config_Trigger_External_Trigger 0x00000070
#define TIMx_SMCR_Config_Master_Slave_Delay_compensation 0x00000080
//引脚信号进行数字滤波
#define TIMx_SMCR_Config_Extern_trigger_filter_1 0x00001000
#define TIMx_SMCR_Config_Extern_trigger_filter_2 0x00002000
#define TIMx_SMCR_Config_Extern_trigger_filter_3 0x00003000
#define TIMx_SMCR_Config_Extern_trigger_filter_4 0x00004000
#define TIMx_SMCR_Config_Extern_trigger_filter_5 0x00005000
#define TIMx_SMCR_Config_Extern_trigger_filter_6 0x00006000
#define TIMx_SMCR_Config_Extern_trigger_filter_7 0x00007000
#define TIMx_SMCR_Config_Extern_trigger_filter_8 0x00008000
#define TIMx_SMCR_Config_Extern_trigger_filter_9 0x00009000
#define TIMx_SMCR_Config_Extern_trigger_filter_A 0x0000A000
#define TIMx_SMCR_Config_Extern_trigger_filter_B 0x0000B000
#define TIMx_SMCR_Config_Extern_trigger_filter_C 0x0000C000
#define TIMx_SMCR_Config_Extern_trigger_filter_D 0x0000D000
#define TIMx_SMCR_Config_Extern_trigger_filter_E 0x0000E000
#define TIMx_SMCR_Config_Extern_trigger_filter_F 0x0000F000
#define TIMx_SMCR_Config_Extern_trigger_Pre_None 0x00000000
//外部触发信号分频
#define TIMx_SMCR_Config_Extern_trigger_Pre_2 0x00001000
#define TIMx_SMCR_Config_Extern_trigger_Pre_4 0x00002000
#define TIMx_SMCR_Config_Extern_trigger_Pre_8 0x00003000
//外部时钟使能
#define TIMx_SMCR_Config_External_Clock_Enable 0x00004000
//ETR引脚的有效边沿极性
#define TIMx_SMCR_Config_External_Trigger_Polarity_Rising 0x00000000
#define TIMx_SMCR_Config_External_Trigger_Polarity_Falling 0x00008000

