StephenGit597/STM32F103C8_Header_Files/STM32F103C8_TIMx.h
//DMA/Interrupt Enable Register
//Update 更新中断
#define TIMx_DIER_Config_Update_Interrupt_Enable 0x00000001
//Capture/Compare x Interrupt Enable
#define TIMx_DIER_Config_Capture_Compare_1_Interrupt_Enable 0x00000002
#define TIMx_DIER_Config_Capture_Compare_2_Interrupt_Enable 0x00000004
#define TIMx_DIER_Config_Capture_Compare_3_Interrupt_Enable 0x00000008
#define TIMx_DIER_Config_Capture_Compare_4_Interrupt_Enable 0x00000010
//COM Interrupt Enable
#define TIMx_DIER_Config_COM_Interrupt_Enable 0x00000020
//Trigger Interrupt Enable
#define TIMx_DIER_Config_Trigger_Interrupt_Enable 0x00000040
//Update DMA Request Enable
#define TIMx_DIER_Config_Break_Interrupt_Enable 0x00000080
//Capture/Compare x DMA Request Enable
#define TIMx_DIER_Config_Update_DMA_Request_Enable 0x00000100
#define TIMx_DIER_Config_Capture_Compare_1_DMA_Request_Enable 0x00000200
#define TIMx_DIER_Config_Capture_Compare_2_DMA_Request_Enable 0x00000400
#define TIMx_DIER_Config_Capture_Compare_3_DMA_Request_Enable 0x00000800
#define TIMx_DIER_Config_Capture_Compare_4_DMA_Request_Enable 0x00001000
//COM DMA Request Enable
#define TIMx_DIER_Config_COM_DMA_Request_Enable 0x00002000
//Trigger DMA Request Enable
#define TIMx_DIER_Config_Trigger_DMA_Request_Enable 0x00004000

//Status Register
//更新事件发生
#define TIMx_SR_Flag_Update_Interrupt_Flag 0x00000001
//通道 x 事件
#define TIMx_SR_Flag_Capture_Compare_1_Interrupt_Flag 0x00000002
#define TIMx_SR_Flag_Capture_Compare_2_Interrupt_Flag 0x00000003
#define TIMx_SR_Flag_Capture_Compare_3_Interrupt_Flag 0x00000004
#define TIMx_SR_Flag_Capture_Compare_4_Interrupt_Flag 0x00000010
//通信事件
#define TIMx_SR_Flag_COM_Interrupt_Flag 0x00000020
//触发事件
#define TIMx_SR_Flag_Trigger_Interrupt_Flag 0x00000040
//刹车事件
#define TIMx_SR_Flag_Break_Interrupt_Flag 0x00000080
//通道 x 捕获溢出
#define TIMx_SR_Flag_Capture_Compare_1_Overcapture_Flag 0x00000200
#define TIMx_SR_Flag_Capture_Compare_2_Overcapture_Flag 0x00000400
#define TIMx_SR_Flag_Capture_Compare_3_Overcapture_Flag 0x00000800
#define TIMx_SR_Flag_Capture_Compare_4_Overcapture_Flag 0x00001000

//Event Generation Register 手动模拟事件触发
//生成更新事件
#define TIMx_EGR_Config_UG_Update_Generation 0x00000001
//触发通道 x 比较事件
#define TIMx_EGR_Config_Capture_Compare_1_Generation 0x00000002
#define TIMx_EGR_Config_Capture_Compare_2_Generation 0x00000004
#define TIMx_EGR_Config_Capture_Compare_3_Generation 0x00000008
#define TIMx_EGR_Config_Capture_Compare_4_Generation 0x00000010
//触发通信事件
#define TIMx_EGR_Config_COM_Generation 0x00000020
//生成触发事件
#define TIMx_EGR_Config_Trigger_Generation 0x00000040
//模拟刹车(Break)事件
#define TIMx_EGR_Config_Break_Generation 0x00000080

//Capture/Compare Mode Register 1
//Capture/Compare CH1  
#define TIMx_Capture_Compare_Mode_Register_CCR1_TI1_Input 0x00000001
#define TIMx_Capture_Compare_Mode_Register_CCR1_TI2_Input 0x00000002
//CH1 output mode
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_Output_Compare_1_Fast_Enable 0x00000004
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_CCR1_preload_Enable 0x00000008
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_Frozen 0x00000000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_Match_Active 0x00000010
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_Match_Inactive 0x00000020
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_Toggle 0x00000030
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_Force_Inactive 0x00000040
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_Force_Active 0x00000050
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_PWM_Mode_1 0x00000060
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_PWM_Mode_2 0x00000070
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_1_clear_enable 0x00000080
//CH1 inpput mode
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_1_no_prescaler 0x00000000
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_1_done_every_2_events 0x00000004
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_1_done_every_4_events 0x00000008
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_1_done_every_8_events 0x0000000C
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_1 0x00000010
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_2 0x00000020
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_3 0x00000030
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_4 0x00000040
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_5 0x00000050
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_6 0x00000060
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_7 0x00000070
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_8 0x00000080
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_9 0x00000090
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_A 0x000000A0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_B 0x000000B0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_C 0x000000C0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_D 0x000000D0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_E 0x000000E0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_1_filter_F 0x000000F0
//Capture/Compare CH2  
#define TIMx_Capture_Compare_Mode_Register_input_mode_CCR2_TI1_Input 0x00000100
#define TIMx_Capture_Compare_Mode_Register_input_mode_CCR2_TI1_Input 0x00000200
//CH2 output mode
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_Output_Compare_1_Fast_Enable 0x00000400
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_CCR1_preload_Enable 0x00000800
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_Frozen 0x00000000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_Match_Active 0x00001000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_Match_Inactive 0x00002000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_Toggle 0x00003000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_Force_Inactive 0x00004000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_Force_Active 0x00005000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_PWM_Mode_1 0x00006000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_PWM_Mode_2 0x00007000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_2_clear_enable 0x00008000
//CH2 inpput mode
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_2_no_prescaler 0x00000000
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_2_done_every_2_events 0x00000400
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_2_done_every_4_events 0x00000800
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_2_done_every_8_events 0x00000C00
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_1 0x00001000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_2 0x00002000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_3 0x00003000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_4 0x00004000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_5 0x00005000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_6 0x00006000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_7 0x00007000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_8 0x00008000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_9 0x00009000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_A 0x0000A000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_B 0x0000B000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_C 0x0000C000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_D 0x0000D000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_E 0x0000E000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_2_filter_F 0x0000F000

//Capture/Compare Mode Register 2
//Capture/Compare CH3  
#define TIMx_Capture_Compare_Mode_Register_CCR3_TI1_Input 0x00000001
#define TIMx_Capture_Compare_Mode_Register_CCR3_TI2_Input 0x00000002
//CH3 output mode
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_Output_Compare_1_Fast_Enable 0x00000004
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_CCR1_preload_Enable 0x00000008
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_Frozen 0x00000000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_Match_Active 0x00000010
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_Match_Inactive 0x00000020
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_Toggle 0x00000030
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_Force_Inactive 0x00000040
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_Force_Active 0x00000050
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_PWM_Mode_1 0x00000060
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_PWM_Mode_2 0x00000070
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_3_clear_enable 0x00000080
//CH3 inpput mode
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_3_no_prescaler 0x00000000
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_3_done_every_2_events 0x00000004
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_3_done_every_4_events 0x00000008
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_3_done_every_8_events 0x0000000C
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_1 0x00000010
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_2 0x00000020
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_3 0x00000030
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_4 0x00000040
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_5 0x00000050
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_6 0x00000060
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_7 0x00000070
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_8 0x00000080
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_9 0x00000090
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_A 0x000000A0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_B 0x000000B0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_C 0x000000C0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_D 0x000000D0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_E 0x000000E0
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_3_filter_F 0x000000F0
//Capture/Compare CH4  
#define TIMx_Capture_Compare_Mode_Register_input_mode_CCR4_TI1_Input 0x00000100
#define TIMx_Capture_Compare_Mode_Register_input_mode_CCR4_TI1_Input 0x00000200
//CH4 output mode
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_Output_Compare_1_Fast_Enable 0x00000400
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_CCR1_preload_Enable 0x00000800
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_Frozen 0x00000000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_Match_Active 0x00001000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_Match_Inactive 0x00002000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_Toggle 0x00003000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_Force_Inactive 0x00004000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_Force_Active 0x00005000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_PWM_Mode_1 0x00006000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_PWM_Mode_2 0x00007000
#define TIMx_Capture_Compare_Mode_Register_Output_mode_Compare_4_clear_enable 0x00008000
//CH4 inpput mode
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_4_no_prescaler 0x00000000
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_4_done_every_2_events 0x00000400
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_4_done_every_4_events 0x00000800
#define TIMx_Capture_Compare_Mode_Register_input_mode_capture_4_done_every_8_events 0x00000C00
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_1 0x00001000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_2 0x00002000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_3 0x00003000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_4 0x00004000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_5 0x00005000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_6 0x00006000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_7 0x00007000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_8 0x00008000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_9 0x00009000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_A 0x0000A000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_B 0x0000B000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_C 0x0000C000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_D 0x0000D000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_E 0x0000E000
#define TIMx_Capture_Compare_Mode_Register_input_mode_Input_Capture_4_filter_F 0x0000F000

//Capture/Compare Enable Register
//CH1----------------------------------------------------------------
#define TIMx_CCER_CC1E_Capture_Compare_1_Output_Enable 0x00000001
//CH1 输出模式
#define TIMx_CCER_CC1P_Capture_Compare_1_Polarity_high 0x00000002
//CH1 输入模式
#define TIMx_CCER_CC1P_Capture_Compare_1_Capture_Rising 0x00000000
#define TIMx_CCER_CC1P_Capture_Compare_1_Capture_Falling 0x00000002
//互补通道
#define TIMx_CCER_CC1NE_Complementary_Output_Enable 0x00000004
//互补通道空闲电平
#define TIMx_CCER_CC1NP_Complementary_Output_Polarity_high 0x00000008
//CH2----------------------------------------------------------------
#define TIMx_CCER_CC2E_Capture_Compare_2_Output_Enable 0x00000010
//CH2 输出模式
#define TIMx_CCER_CC2P_Capture_Compare_2_Polarity_high 0x00000020
//CH2 输入模式
#define TIMx_CCER_CC2P_Capture_Compare_2_Capture_Rising 0x00000000
#define TIMx_CCER_CC2P_Capture_Compare_2_Capture_Falling 0x00000020
//互补通道
#define TIMx_CCER_CC2NE_Complementary_Output_Enable 0x00000040
//互补通道空闲电平
#define TIMx_CCER_CC2NP_Complementary_Output_Polarity_high 0x00000080
//CH3----------------------------------------------------------------
#define TIMx_CCER_CC3E_Capture_Compare_3_Output_Enable 0x00000100
//CH3 输出模式
#define TIMx_CCER_CC3P_Capture_Compare_3_Polarity_high 0x00000200
//CH3 输入模式
#define TIMx_CCER_CC3P_Capture_Compare_3_Capture_Rising 0x00000000
#define TIMx_CCER_CC3P_Capture_Compare_3_Capture_Falling 0x00000200
//互补通道
#define TIMx_CCER_CC3NE_Complementary_Output_Enable 0x00000400
//互补通道空闲电平
#define TIMx_CCER_CC3NP_Complementary_Output_Polarity_high 0x00000800
//CH4----------------------------------------------------------------
#define TIMx_CCER_CC4E_Capture_Compare_4_Output_Enable 0x00001000
//CH4 输出模式
#define TIMx_CCER_CC4P_Capture_Compare_4_Polarity_high 0x00002000
//CH4 输入模式
#define TIMx_CCER_CC4P_Capture_Compare_4_Capture_Rising 0x00000000
#define TIMx_CCER_CC4P_Capture_Compare_4_Capture_Falling 0x00002000
//互补通道
#define TIMx_CCER_CC4NE_Complementary_Output_Enable 0x00004000
//互补通道空闲电平
#define TIMx_CCER_CC4NP_Complementary_Output_Polarity_high 0x00008000

//Counter Register

//Prescaler Register

//Auto-Reload Register

//Repetition Counter Register

