StephenGit597/STM32F103C8_Header_Files/STM32F103C8_TIMx.h
//----------------------Capture/Compare Register 1
//输出模式：存储比较值，用于与 CNT 比较，决定 PWM 占空比
//输入模式：硬件自动写入捕获时刻的 CNT 值，作为时间戳

//----------------------Capture/Compare Register 2
//输出模式：存储比较值，用于与 CNT 比较，决定 PWM 占空比
//输入模式：硬件自动写入捕获时刻的 CNT 值，作为时间戳

//----------------------Capture/Compare Register 3
//输出模式：存储比较值，用于与 CNT 比较，决定 PWM 占空比
//输入模式：硬件自动写入捕获时刻的 CNT 值，作为时间戳

//----------------------Capture/Compare Register 4
//输出模式：存储比较值，用于与 CNT 比较，决定 PWM 占空比
//输入模式：硬件自动写入捕获时刻的 CNT 值，作为时间戳

//Break and Dead-Time Register
//死区时间设置 bit7-bot0
//锁定等级
#define TIMx_BDTR_Config_LOCK_OFF 0x00000000
#define TIMx_BDTR_Config_LOCK_Level_1 0x00000100
#define TIMx_BDTR_Config_LOCK_Level_2 0x00000200
#define TIMx_BDTR_Config_LOCK_Level_3 0x00000300
//使能刹车输入
#define TIMx_BDTR_Config_BKE_Break_Enable 0x00001000
//刹车极性(0=高电平有效,1=低电平有效）
#define TIMx_BDTR_Config_BKP_Break_Polarity_high 0x00000000
#define TIMx_BDTR_Config_BKP_Break_Polarity_low 0x00002000
//AOE Automatic Output Enable
#define TIMx_BDTR_Config_AOE_Automatic_Output_Enable 0x00004000
//MOE Main Output Enable 全局使能所有输出
#define TIMx_BDTR_Config_Main Output 0x00008000

//DMA Control Register
//bit0 bit1 bit2 bit3 bit4 DBA[4:0] DMA Base Address 突发传输的起始寄存器
//bit8 bit9 bit10 bit11 bit12 DBL[4:0] 一次触发需要连续传输的寄存器个数
//DMA 控制器读写 DMAR 时，硬件会根据 DCR 的配置，自动映射到真实的定时器寄存器组
#define TIMx_DMA_Control_Register_Base_TIMx_CR1 0x00000000
#define TIMx_DMA_Control_Register_Base_TIMx_CR2 0x00000001
#define TIMx_DMA_Control_Register_Base_TIMx_SMCR 0x00000010
#define TIMx_DMA_Control_Register_Base_TIMx_CCMR1 0x00000110
#define TIMx_DMA_Control_Register_Base_TIMx_CCER 0x00001000
#define TIMx_DMA_Control_Register_Base_TIMx_PSC 0x00001010
#define TIMx_DMA_Control_Register_Base_TIMx_ARR 0x00001011
#define TIMx_DMA_Control_Register_Base_TIMx_RCR 0x00001100
#define TIMx_DMA_Control_Register_Base_TIMx_CCR1 0x00001101
#define TIMx_DMA_Control_Register_Base_TIMx_CCR2 0x00001110
#define TIMx_DMA_Control_Register_Base_TIMx_CCR3 0x00001111
#define TIMx_DMA_Control_Register_Base_TIMx_CCR4 0x00010000

#endif